       01 CUSTOMER-RECORD.
           05 CUST-ID
               PIC X(10).

           05 CUST-NAME
               PIC X(30).

           05 CUST-TYPE
               PIC X(10).

           05 CUST-STATUS
               PIC X(8).

           05 CUST-TAX-RATE
               PIC 9V999.

           05 CUST-PREV-BALANCE
               PIC 9(7)V99.
               